Revit 2027 API
AdaptiveComponentFamilyUtils.GetPointOrientationType Method
 Gets orientation type of an Adaptive Placement Point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static AdaptivePointOrientationType GetPointOrientationType(
	Document doc,
	ElementId refPointId
)
Public Shared Function GetPointOrientationType (
	doc As Document,
	refPointId As ElementId
) As AdaptivePointOrientationType
public:
static AdaptivePointOrientationType GetPointOrientationType(
	Document^ doc,
	ElementId^ refPointId
)
static member GetPointOrientationType :
        doc : Document *
        refPointId : ElementId -> AdaptivePointOrientationType
Parameters
doc Document
 The Document
refPointId ElementId
 The ReferencePoint id
Return Value
AdaptivePointOrientationType
 Orientation type of Adaptive Placement Point.
Exceptions
Exception | Condition
ArgumentException |  The ElementId refPointId does not correspond to a valid ReferencePoint. -or- The Element corresponding to ElementId refPointId does not belong to an Adaptive Family. -or- The ElementId refPointId does not correspond to an Adaptive Placement Point.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AdaptiveComponentFamilyUtils Class
Autodesk.Revit.DB Namespace